class script(object):
    START_TXT = """<b>Hɪ  {} 👋,

ɪ ᴀᴍ ᴀɴ ᴀᴅᴠᴀɴᴄᴇᴅ ᴀɴᴅ ᴘᴏᴡᴇʀꜰᴜʟ ꜰɪʟᴇ ꜱᴛᴏʀᴀɢᴇ ʙᴏᴛ. 📁
ꜱᴇɴᴅ ᴍᴇ ᴀɴʏ ꜰɪʟᴇ, ᴅᴏᴄᴜᴍᴇɴᴛ, ᴠɪᴅᴇᴏ, ᴀᴜᴅɪᴏ ᴏʀ ᴀɴɪᴍᴀᴛɪᴏɴ, ᴀɴᴅ ɪ ᴡɪʟʟ ꜱᴛᴏʀᴇ ɪᴛ ɪɴ ᴍʏ ᴅᴀᴛᴀʙᴀꜱᴇ ᴄʜᴀɴɴᴇʟ.

‼️ ᴄʟɪᴄᴋ ᴏɴ ʜᴇʟᴘ ᴛᴏ ɢᴇᴛ ꜰᴜʟʟ ᴅᴇᴛᴀɪʟꜱ ᴏꜰ ᴀʟʟ ᴍʏ ꜰᴇᴀᴛᴜʀᴇꜱ.</b>"""
    
    CAPTION = """<b>══════════════════
📂 <i><a href="http://t.me/AV_MOVIE_HOUSE">{file_name}</a></i>
═══════════════════ 
Size ⚙️: {file_size}
╔══════════════════╗
   <a href='http://t.me/AV_UPLOAD_MOVIES'>🔱 𝐂𝐇𝐀𝐍𝐍𝐄𝐋 🔱</a></b>
╚══════════════════╝</b>""" 

    LOG_TEXT = """<b>#NewUser {}
    
ID - <code>{}</code>
Nᴀᴍᴇ - {}</b>"""

    ABOUT_TXT = """<b>╔══❰ {} ❱═════❍
║╭━━━━━━━━━━━━━━━━━━➣
║┣⪼🤖ᴍʏ ɴᴀᴍᴇ : {}
║┣⪼👦ᴏᴡɴᴇʀ : <a href='https://t.me/AKASH_RAJBHAR1'>#𝙰𝙺𝙰𝚂𝙷_𝚁𝙰𝙹𝙱𝙷𝙰𝚁</a>
║┣⪼👨‍💻ᴅᴇᴠᴇʟᴏᴘᴇʀ : <a href='https://t.me/BOT_OWNER26'>Aᴍᴀɴ Dᴇᴠᴇʟᴏᴘᴇʀ⚠️</a>
║┣⪼❣️ᴜᴘᴅᴀᴛᴇ : <a href=https://t.me/AV_BOTz_UPDATE>ᴀᴠ ʙᴏᴛᴢ</a>
║┣⪼📡Hᴏsᴛᴇᴅ ᴏɴ : ᴋᴏʏᴇʙ 
║┣⪼🗣️ʟᴀɴɢᴜᴀɢᴇ : ᴘʏᴛʜᴏɴ 
║┣⪼📚ʟɪʙʀᴀʀʏ : ᴘʏʀᴏɢʀᴀᴍ
║┣⪼🗒️ᴠᴇʀsɪᴏɴ : 2.60.00[sᴛᴀʙʟᴇ]
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍ </b>"""

    HELP_TXT = """<b>⚠️ ʏᴏᴜ ᴡɪʟʟ ɢᴇᴛ ᴛᴏ ꜱᴇᴇ ᴀʟʟ ᴛʜɪꜱ ɪɴ ᴛʜᴇ /settings ᴄᴏᴍᴍᴀɴᴅ...

- ʏᴏᴜ ᴄᴀɴ ᴅᴏ ᴏɴ/ᴏꜰꜰ ɪɴ ꜰɪʟᴇ ᴘʀᴏᴛᴇᴄᴛɪᴏɴ.
- ʏᴏᴜ ᴄᴀɴ ꜱᴇᴛ ᴄᴜꜱᴛᴏᴍ ꜰɪʟᴇ ᴄᴀᴘᴛɪᴏɴ.
- ʏᴏᴜ ᴄᴀɴ ᴀᴅᴅ ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ ʟɪɴᴋ.
- ʏᴏᴜ ᴄᴀɴ ᴀᴅᴅ ꜱʜᴏʀᴛʟɪɴᴋ ꜰᴏʀ ᴅɪʀᴇᴄᴛ ꜰɪʟᴇ ʟɪɴᴋ.
- ʏᴏᴜ ᴄᴀɴ ᴀᴅᴅ ᴛᴡᴏ ꜱʜᴏʀᴛʟɪɴᴋ ꜰᴏʀ ᴇᴀᴄʜ ᴠᴇʀɪꜰʏ.
- ʏᴏᴜ ᴄᴀɴ ᴀᴅᴅ ᴜꜱᴇʀ ᴠᴇʀɪꜰɪᴇᴅ ɪɴꜰᴏ ʟᴏɢ ᴄʜᴀɴɴᴇʟ.
- ʏᴏᴜ ᴄᴀɴ ᴅᴏ ᴏɴ/ᴏꜰꜰ ꜰᴏʀ 𝟷sᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ.
- ʏᴏᴜ ᴄᴀɴ ᴀᴅᴅ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ᴛɪᴍᴇ.
- ʏᴏᴜ ᴄᴀɴ ᴀᴅᴅ ᴍᴜʟᴛɪᴘʟᴇ ꜰᴏʀᴄᴇ ꜱᴜʙꜱᴄʀɪʙᴇ ᴄʜᴀɴɴᴇʟ.

✅ ʏᴏᴜ ᴄᴀɴ ᴄʜᴀɴɢᴇ ᴀʟʟ ᴛʜᴇꜱᴇ ꜱᴇᴛᴛɪɴɢꜱ ᴀᴄᴄᴏʀᴅɪɴɢ ᴛᴏ ʏᴏᴜʀ ɴᴇᴇᴅ.</b>"""
    
    VERIFICATION_TEXT = """<b>👋 ʜᴇʏ {},

📌 <u>ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴠᴇʀɪꜰɪᴇᴅ ᴛᴏᴅᴀʏ, ᴛᴀᴘ ᴏɴ ᴛʜᴇ ᴠᴇʀɪꜰʏ ʟɪɴᴋ & ɢᴇᴛ ᴜɴʟɪᴍɪᴛᴇᴅ ᴀᴄᴄᴇss ꜰᴏʀ ɴᴇxᴛ ꜰᴜʟʟ ᴅᴀʏ.</u></b>"""
    
    VERIFIED_COMPLETE_TEXT = """<b>👋 ʜᴇʏ {},

ʏᴏᴜ ᴀʀᴇ ɴᴏᴡ ᴠᴇʀɪꜰɪᴇᴅ ꜰᴏʀ ᴛᴏᴅᴀʏ ☺️.
ᴇɴᴊᴏʏ ᴜɴʟɪᴍɪᴛᴇᴅ ᴍᴏᴠɪᴇs ᴏʀ sᴇʀɪᴇs ʟɪɴᴋs 💥.</b>"""
    
    VERIFIED_LOG_TEXT = """<b><u>☄ ᴜsᴇʀ ᴠᴇʀɪꜰɪᴇᴅ sᴜᴄᴄᴇssꜰᴜʟʟʏ ☄</u>

⚡️ ɴᴀᴍᴇ:- {} [ <code>{}</code> ] 
📆 ᴅᴀᴛᴇ:- <code>{} </code></b>

#verified_completed"""

